Revit 2027 API
ProfileFamilyUsage Enumeration
 An enumerated type listing all types of profile families.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ProfileFamilyUsage
Public Enumeration ProfileFamilyUsage
public enum class ProfileFamilyUsage
type ProfileFamilyUsage
Members
Member name | Value | Description
Any | 0 |  Any type of profile family.
ContinuousFooting | 10 |  Continuous Footing.
Fascia | 3 |  Fascia.
Gutter | 4 |  Gutter.
Mullion | 8 |  Mullion.
Railing | 6 |  Railing.
Reveal | 2 |  Reveal.
SlabEdge | 5 |  Slab edge.
SlabMetalDeck | 9 |  Slab Metal Deck.
StairNosing | 7 |  Stair Nosing.
StairRiser | 12 |  Stair Riser.
StairSupport | 13 |  Stair Support.
StairTread | 11 |  Stair Tread.
WallSweep | 1 |  Wall sweep.
See Also
Reference
Autodesk.Revit.DB Namespace